## Import packages

In [1]:
import requests
import pandas as pd
import os
import time

## API access parameters

In [2]:
my_api_key = "51356ef8-f7dd-43a1-9629-1965b7830a26"
base_url = "https://api.ember-climate.org"

## Parameters for the charts

### Countries to import

In [3]:
iso_codes = [
    "ALB",  # Albania
    "AUT",  # Austria
    "BEL",  # Belgium
    "BIH",  # Bosnia and Herzegovina
    "BGR",  # Bulgaria
    "HRV",  # Croatia
    "CYP",  # Cyprus
    "CZE",  # Czech Republic
    "DNK",  # Denmark
    "EST",  # Estonia
    "FIN",  # Finland
    "FRA",  # France
    "DEU",  # Germany
    "GRC",  # Greece
    "HUN",  # Hungary
    "IRL",  # Ireland
    "ITA",  # Italy
    "XKX",  # Kosovo
    "LVA",  # Latvia
    "LTU",  # Lithuania
    "LUX",  # Luxembourg
    "MLT",  # Malta
    "MDA",  # Moldova
    "MNE",  # Montenegro
    "NLD",  # Netherlands
    "MKD",  # North Macedonia
    "NOR",  # Norway
    "POL",  # Poland
    "PRT",  # Portugal
    "ROU",  # Romania
    "SRB",  # Serbia
    "SVK",  # Slovakia
    "SVN",  # Slovenia
    "ESP",  # Spain
    "SWE",  # Sweden
    "CHE",  # Switzerland
    "TUR",  # Turkey
    "GBR",  # United Kingdom
]

### Number of months we want to display on the charts

In [4]:
last_month = 12
last_year = 2023

nbr_months_rolling_year = 12

#### Listing the months we will have, based on the parameters we have chosen

In [5]:
months_old_rolling_year = [
    f"{year}-{month:02d}-01"
    for year, month in [
        time.localtime(
            time.mktime((last_year - 1, last_month  - n, 1, 0, 0, 0, 0, 0, 0))
        )[:2]
        for n in range(nbr_months_rolling_year)
    ]
]
months_new_rolling_year = [
    f"{year}-{month:02d}-01"
    for year, month in [
        time.localtime(
            time.mktime((last_year, last_month  - n, 1, 0, 0, 0, 0, 0, 0))
        )[:2]
        for n in range(nbr_months_rolling_year)
    ]
]

months_expected = [
    f"{month:02d}"
    for year, month in [
        time.localtime(
            time.mktime((last_year, last_month  - n, 1, 0, 0, 0, 0, 0, 0))
        )[:2]
        for n in range(nbr_months_rolling_year)
    ]
]

In [6]:
months_old_rolling_year

['2022-12-01',
 '2022-11-01',
 '2022-10-01',
 '2022-09-01',
 '2022-08-01',
 '2022-07-01',
 '2022-06-01',
 '2022-05-01',
 '2022-04-01',
 '2022-03-01',
 '2022-02-01',
 '2022-01-01']

In [7]:
months_new_rolling_year

['2023-12-01',
 '2023-11-01',
 '2023-10-01',
 '2023-09-01',
 '2023-08-01',
 '2023-07-01',
 '2023-06-01',
 '2023-05-01',
 '2023-04-01',
 '2023-03-01',
 '2023-02-01',
 '2023-01-01']

## Running the API

### Queries

In [8]:
query_url_generation = (
    f"{base_url}/v1/electricity-generation/monthly"
    + f"?entity_code={','.join(iso_codes)}&is_aggregate_series=false&start_date=2000&api_key={my_api_key}"
)

query_url_demand = (
    f"{base_url}/v1/electricity-demand/monthly"
    + f"?entity_code={','.join(iso_codes)}&is_aggregate_series=false&start_date=2000&api_key={my_api_key}"
)

In [9]:
query_url_generation

'https://api.ember-climate.org/v1/electricity-generation/monthly?entity_code=ALB,AUT,BEL,BIH,BGR,HRV,CYP,CZE,DNK,EST,FIN,FRA,DEU,GRC,HUN,IRL,ITA,XKX,LVA,LTU,LUX,MLT,MDA,MNE,NLD,MKD,NOR,POL,PRT,ROU,SRB,SVK,SVN,ESP,SWE,CHE,TUR,GBR&is_aggregate_series=false&start_date=2000&api_key=51356ef8-f7dd-43a1-9629-1965b7830a26'

In [10]:
query_url_demand

'https://api.ember-climate.org/v1/electricity-demand/monthly?entity_code=ALB,AUT,BEL,BIH,BGR,HRV,CYP,CZE,DNK,EST,FIN,FRA,DEU,GRC,HUN,IRL,ITA,XKX,LVA,LTU,LUX,MLT,MDA,MNE,NLD,MKD,NOR,POL,PRT,ROU,SRB,SVK,SVN,ESP,SWE,CHE,TUR,GBR&is_aggregate_series=false&start_date=2000&api_key=51356ef8-f7dd-43a1-9629-1965b7830a26'

### Executing the queries. 200 = success

In [11]:
response_generation = requests.get(query_url_generation)
response_demand = requests.get(query_url_demand)

In [12]:
response_generation.status_code

200

In [13]:
response_demand.status_code

200

## Extracting the results

In [14]:
data_generation = response_generation.json()["data"]
data_demand = response_demand.json()["data"]
df_generation = pd.DataFrame(data_generation)
df_demand = pd.DataFrame(data_demand)

In [15]:
df_generation

,entity,entity_code,is_aggregate_entity,date,series,is_aggregate_series,generation_twh,share_of_generation_pct
0,Austria,AUT,False,2015-01-01,Bioenergy,False,0.23,4.23
1,Austria,AUT,False,2015-01-01,Coal,False,0.26,4.78
2,Austria,AUT,False,2015-01-01,Gas,False,1.16,21.32
3,Austria,AUT,False,2015-01-01,Hydro,False,2.98,54.78
4,Austria,AUT,False,2015-01-01,Net imports,False,2.08,38.24
...,...,...,...,...,...,...,...,...
31012,United Kingdom,GBR,False,2024-06-01,Net imports,False,2.95,17.87
31013,United Kingdom,GBR,False,2024-06-01,Nuclear,False,3.38,20.47
31014,United Kingdom,GBR,False,2024-06-01,Other fossil,False,0.29,1.76
31015,United Kingdom,GBR,False,2024-06-01,Solar,False,2.02,12.24
31016,United Kingdom,GBR,False,2024-06-01,Wind,False,5.17,31.31

In [16]:
df_demand

              entity entity_code  is_aggregate_entity        date  demand_twh
0            Austria         AUT                False  2015-01-01        7.52
1            Austria         AUT                False  2015-02-01        6.34
2            Austria         AUT                False  2015-03-01        6.77
3            Austria         AUT                False  2015-04-01        5.89
4            Austria         AUT                False  2015-05-01        5.56
...              ...         ...                  ...         ...         ...
3757  United Kingdom         GBR                False  2024-02-01       23.19
3758  United Kingdom         GBR                False  2024-03-01       23.86
3759  United Kingdom         GBR                False  2024-04-01       21.88
3760  United Kingdom         GBR                False  2024-05-01       19.22
3761  United Kingdom         GBR                False  2024-06-01       19.46

[3762 rows x 5 columns]

### Filtering only the data that we need

#### We extract the month from the date

In [17]:
df_generation["month"] = df_generation["date"].str[5:7]
df_demand["month"] = df_demand["date"].str[5:7]

#### We create one table with the current ('new') data, one table with the data we compare with ('old')

In [18]:
df_generation_old = df_generation.loc[
        df_generation["date"].isin(months_old_rolling_year)
    ].copy()
df_generation_old["generation_twh_old"] = df_generation_old["generation_twh"]
df_generation_old = df_generation_old[
        ["entity", "entity_code", "month", "series", "generation_twh_old"]
    ]
df_generation_new = df_generation.loc[
        df_generation["date"].isin(months_new_rolling_year)
    ].copy()
df_generation_new["generation_twh_new"] = df_generation_new["generation_twh"]
df_generation_new = df_generation_new[
        ["entity", "entity_code", "month", "series", "generation_twh_new", "date"]
    ]

In [19]:
df_demand_old = df_demand.loc[df_demand["date"].isin(months_old_rolling_year)].copy()
df_demand_old["series"] = "Demand"
df_demand_old[f"generation_twh_old"] = df_demand_old["demand_twh"]
df_demand_old = df_demand_old[
        ["entity", "entity_code", "month", "series", "generation_twh_old"]
    ]

df_demand_new = df_demand.loc[df_demand["date"].isin(months_new_rolling_year)].copy()
df_demand_new["series"] = "Demand"
df_demand_new[f"generation_twh_new"] = df_demand_new["demand_twh"]
df_demand_new = df_demand_new[
        ["entity", "entity_code", "month", "series", "generation_twh_new", "date"]
    ]

#### We merge generation and demand tables

In [20]:
df_old = pd.concat([df_generation_old, df_demand_old])
df_new = pd.concat([df_generation_new, df_demand_new])

In [21]:
df_old[(df_old.entity_code == 'IRL') & (df_old.month == '12')]

        entity entity_code month        series  generation_twh_old
13918  Ireland         IRL    12     Bioenergy                0.01
13919  Ireland         IRL    12          Coal                0.23
13920  Ireland         IRL    12           Gas                1.40
13921  Ireland         IRL    12         Hydro                0.09
13922  Ireland         IRL    12   Net imports                0.25
13923  Ireland         IRL    12  Other fossil                0.20
13924  Ireland         IRL    12         Solar                0.00
13925  Ireland         IRL    12          Wind                1.03
1604   Ireland         IRL    12        Demand                3.21

#### We merge the 'old' and 'new'

In [22]:
df_all = pd.merge(
        df_old, df_new, how="inner", on=["entity", "entity_code", "series", "month"]
    )

#### We rename some categories

In [23]:
df_all["series"] = df_all["series"].apply(
        lambda x: (
            "Other"
            if x in ["Bioenergy", "Net imports", "Other renewables", "Other fossil"]
            else x
        )
    )
df_all = df_all.fillna(0)

### Data checks

In [24]:
combinations = [(x, y) for x in iso_codes for y in months_expected]
expected_outcome = pd.DataFrame(combinations, columns=['entity_code', 'month'])

#### Missing countries in generation - Old

In [25]:
df_generation_old_check = df_generation_old[df_generation_old.generation_twh_old > 0]
df_generation_old_check = df_generation_old_check[['entity_code','month']].drop_duplicates()

expected_outcome[~expected_outcome.set_index(['entity_code','month']).index.isin(df_generation_old_check.set_index(['entity_code','month']).index)]

   entity_code month
0          ALB    12
1          ALB    11
2          ALB    10
3          ALB    09
4          ALB    08
5          ALB    07
6          ALB    06
7          ALB    05
8          ALB    04
9          ALB    03
10         ALB    02
11         ALB    01

#### Missing countries in demand - Old

In [26]:
df_demand_old_check = df_demand_old[df_demand_old.generation_twh_old > 0]
df_demand_old_check = df_demand_old_check[['entity_code','month']].drop_duplicates()

expected_outcome[~expected_outcome.set_index(['entity_code','month']).index.isin(df_demand_old_check.set_index(['entity_code','month']).index)]

   entity_code month
0          ALB    12
1          ALB    11
2          ALB    10
3          ALB    09
4          ALB    08
5          ALB    07
6          ALB    06
7          ALB    05
8          ALB    04
9          ALB    03
10         ALB    02
11         ALB    01

#### Missing countries in generation - New

In [27]:
df_demand_new_check = df_demand_new[df_demand_new.generation_twh_new > 0]
df_demand_new_check = df_demand_new_check[['entity_code','month']].drop_duplicates()

expected_outcome[~expected_outcome.set_index(['entity_code','month']).index.isin(df_demand_new_check.set_index(['entity_code','month']).index)]

   entity_code month
0          ALB    12
1          ALB    11
2          ALB    10
3          ALB    09
4          ALB    08
5          ALB    07
6          ALB    06
7          ALB    05
8          ALB    04
9          ALB    03
10         ALB    02
11         ALB    01

#### Missing countries in demand - New

In [28]:
df_generation_new_check = df_generation_new[df_generation_new.generation_twh_new > 0]
df_generation_new_check = df_generation_new_check[['entity_code','month']].drop_duplicates()

expected_outcome[~expected_outcome.set_index(['entity_code','month']).index.isin(df_generation_new_check.set_index(['entity_code','month']).index)]

   entity_code month
0          ALB    12
1          ALB    11
2          ALB    10
3          ALB    09
4          ALB    08
5          ALB    07
6          ALB    06
7          ALB    05
8          ALB    04
9          ALB    03
10         ALB    02
11         ALB    01

In [29]:
df_all[df_all.date == 0]

Empty DataFrame
Columns: [entity, entity_code, month, series, generation_twh_old, generation_twh_new, date]
Index: []

### Final data extraction

#### We extract what we need

In [30]:
output_rolling_year = (
        df_all[
            ["month", "series", "date", "generation_twh_old", "generation_twh_new"]
        ]
        .groupby(["month", "series", "date"])
        .sum()
        .reset_index()
    )
output_rolling_year["y-o-y change"] = (
        output_rolling_year["generation_twh_new"]
        - output_rolling_year["generation_twh_old"]
    )

In [31]:
cwd = os.getcwd()
excel_path_rolling_year = os.path.join(cwd, "data_rolling_year.xlsx")
output_rolling_year.to_excel(excel_path_rolling_year, index=False)

In [32]:
excel_path_rolling_year

'/Users/acas/Dropbox/GitHub/Quarterly-slides/data_rolling_year.xlsx'

In [33]:
output_rolling_year

,month,series,date,generation_twh_old,generation_twh_new,y-o-y change
0,01,Coal,2023-01-01,55.03,51.81,-3.22
1,01,Demand,2023-01-01,338.62,317.45,-21.17
2,01,Gas,2023-01-01,72.77,54.47,-18.30
3,01,Hydro,2023-01-01,48.95,50.16,1.21
4,01,Nuclear,2023-01-01,69.91,63.08,-6.83
...,...,...,...,...,...,...
91,12,Hydro,2023-12-01,47.35,58.69,11.34
92,12,Nuclear,2023-12-01,60.66,62.21,1.55
93,12,Other,2023-12-01,23.39,21.02,-2.37
94,12,Solar,2023-12-01,5.57,8.36,2.79
95,12,Wind,2023-12-01,52.48,69.78,17.30